Repository: Automattic/regenerate-thumbnails
Catalog: localization/regenerate-thumbnails-*.po
Languages: pl_pl, ru_ru

source: Please don't clone RegenerateThumbnails
pl_pl: Proszę nie klonować wtyczki Odnawianie miniaturek
ru_ru: Пожалуйста не клонируйте RegenerateThumbnails

source: Please don't unserialize/wakeup RegenerateThumbnails
pl_pl: Proszę nie przekształcać/wskrzeszać wtyczki Odnawianie miniaturek
ru_ru: Пожалуйста не десериализируйте/пробуждайте RegenerateThumbnails

source: Regenerate Thumbnails
pl_pl: Odnawianie miniaturek
ru_ru: Пересоздание миниатюр

source: Regen. Thumbnails
pl_pl: Odnawianie miniaturek
ru_ru: Пересоздать миниатюры

source: Regenerate the thumbnails for this single image
pl_pl: Odnów miniaturki dla tego obrazka
ru_ru: Пересоздать миниатюры для этого изображения

source: Cheatin&#8217; uh?
pl_pl: Oszukiwać się zachciało?
ru_ru: Хакер, чтоле?

source: Unable to find any images. Are you sure <a href='%s'>some exist</a>?
pl_pl: Nie można znaleźć żadnych obrazków. Czy w ogóle <a href='%s'>jakieś są przesłane</a>?
ru_ru: Не найдено ни одного изображения. Вы уверены, что <a href='%s'>они есть</a>?

source: Please be patient while the thumbnails are regenerated. This can take a while if your server is slow (inexpensive hosting) or if you have many images. Do not navigate away from this page until this script is done or the thumbnails will not be resized. You will be notified via this page when the regenerating is completed.
pl_pl: Proszę zachować cierpliwość podczas odnawiania miniaturek. Może to trochę potrwać jeżeli serwer jest wolny (tani hosting) lub jeżeli masz wiele obrazków. Nie opuszczaj tej strony przed zakończeniem skryptu, inaczej nie zostaną zmienione rozmiary miniaturek. Otrzymasz powiadomienie po zakończeniu procesu odnawiania.
ru_ru: Пожалуйста, подождите пока миниатюры пересоздаются. Это может занять некоторое время, если ваш сервер медленный (недорогой хостинг) или у вас много картинок. Не покидайте эту страницу пока скрипт не выполнится до конца или же миниатюры не пересоздадутся. Вы будете оповещены, когда пересоздание миниатюр будет завершено.

source: To go back to the previous page, <a href="%s">click here</a>.
pl_pl: Aby powrócić do poprzedniej strony, <a href="%s">naciśnij tutaj</a>.
ru_ru: Чтоб вернутся на предыдущую страницу, <a href="%s">нажмите здесь</a>.

source: All done! %1$s image(s) were successfully resized in %2$s seconds and there were %3$s failure(s). To try regenerating the failed images again, <a href="%4$s">click here</a>. %5$s
pl_pl: Gotowe! Obrazki w liczbie %1$s zostały pomyślnie zmienione do nowych rozmiarów w przeciągu %2$s sekund. Obrazki w liczbie %3$s nie zostały zmienione z powodu błędu. Aby spróbować je odnowić ponownie, <a href="%4$s">naciśnij tutaj</a>. %5$s
ru_ru: Готово! Для %1$s изображений были созданы миниатюры за %2$s с. Не удалось создать миниатюры для %3$s изображений. Чтоб попробовать пересоздать миниатюры для неудавшихся изображений, <a href="%4$s">нажмите сюда</a>. %5$s

source: Allows you to regenerate thumbnail images for times when you change thumbnail sizes or switch to a theme with a different featured image size.
pl_pl: Umożliwia odnowę wszystkich miniaturek po zmianie ich wymiarów lub po przełączeniu na inny motyw z innymi wymiarami obrazków.
ru_ru: Позволяет вам пересоздать миниатюры изображений в тех случаях, когда вы изменили размеры миниатюр или выбрали другую тему, где используются другие размеры миниатюр.

source: All done! %1$s image(s) were successfully resized in %2$s seconds and there were 0 failures. %3$s
pl_pl: Gotowe! Wszystkie obrazki w liczbie %1$s zostały pomyślnie zmienione do nowych rozmiarów w przeciągu %2$s sekund. %3$s
ru_ru: Готово! Для %1$s изображений были созданы миниатюры за %2$s с. %3$s

source: You must enable Javascript in order to proceed!
pl_pl: Aby uruchomić skrypt, musisz włączyć Javascript!
ru_ru: Вы должны включить Javascript в браузере чтоб пользоваться данным инструментом!

source: Abort Resizing Images
pl_pl: O zmianie rozmiarów obrazków
ru_ru: Отменить пересоздание миниатюр

source: Debugging Information
pl_pl: Informacje debugowe
ru_ru: Отладочная информация

source: Total Images: %s
pl_pl: Ogólnie obrazków: %s
ru_ru: Всего изображений: %s

source: Images Resized: %s
pl_pl: Obrazki o zmienionych rozmiarach: %s
ru_ru: Изображения, для которых были созданы миниатюры: %s

source: Resize Failures: %s
pl_pl: Błędy zmiany rozmiaru: %s
ru_ru: Изображения, для которых не удалось пересоздать миниатюры: %s

source: Stopping...
pl_pl: Zatrzymywanie...
ru_ru: Остановка...

source: Use this tool to regenerate thumbnails for all images that you have uploaded to your site. This is useful if you've changed any of the thumbnail dimensions on the <a href='%s'>media settings page</a> or switched themes. Old thumbnails will be kept to avoid any broken images due to hard-coded URLs.
pl_pl: Skorzytaj z tego narzędzia, aby odnowić miniaturki dla wszystkich obrazków przesłanych na Twoją stronę. Jest ono przydatne po zmianie wymiarów miniaturek na <a href='%s'>stronie ustawień mediów</a> lub po przełączeniu motywu. Stare miniaturki zostaną zachowane, aby zapobiec błędom w przypadku bardzo złożonych adresów URL.
ru_ru: С помощью этого инструменты вы можете пересоздать миниатюры для всех изображений, которые были загружены на ваш сайт. Это имеет смысл, если вы изменили один из размеров миниатюр на <a href='%s'>странице настройки медиафайлов</a> или выбрали другую тему. Старые миниатюры останутся нетронутыми, чтоб избежать &laquo;битых&raquo; ссылок на изображения, если они были где-то использованы вручную.

source: You can regenerate specific images (rather than all images) from the <a href='%s'>Media</a> page. Hover over an image's row and click the link to resize just that one image or use the checkboxes and the &quot;Bulk Actions&quot; dropdown to resize multiple images (WordPress 3.1+ only).
pl_pl: Możesz odnowić konkretne obrazki (zamiast wszystkich) ze strony <a href='%s'>Mediów</a>. Nakieruj na wiersz obrazka i naciśnij na odnośnik, aby zmienić rozmiar tego jednego obrazka lub zaznacz obrazki polami wyboru i z rozwijanej listy &quot;Masowe akcje&quot; wybierz zmianę rozmiarów wielu obrazków (tylko WordPress 3.1+).
ru_ru: Вы можете пересоздать миниатюры для некоторых изображений (предпочтительней, чем для всех изображений) со страницы <a href='%s'>Медиафайлы</a>. Наведите курсор на ряд с изображением и нажмите на ссылку, чтоб пересоздать миниатюры только для данного изображения или используйте чекбоксы и выпадающий список &quot;Действия&quot; чтоб пересоздать миниатюры для выбранных изображений (только для WordPress 3.1 и выше)

source: Thumbnail regeneration is not reversible, but you can just change your thumbnail dimensions back to the old values and click the button again if you don't like the results.
pl_pl: Odnowa miniaturek jest nieodwracalna, ale jeżeli wynik Cię nie zadowala, możesz po prostu zmienić z powrotem wymiary miniaturek do starych wartości i ponownie nacisnąć przycisk.
ru_ru: Пересоздание миниатюр невозможно отменить. Но вы можете просто вернуть старые размеры миниатюр и нажать на кнопку еще раз, если вас не устроит результат.

source: To begin, just press the button below.
pl_pl: Aby rozpocząć, po prostu naciśnij przycisk poniżej.
ru_ru: Чтоб начать, просто нажмите на кнопку ниже.

source: Regenerate All Thumbnails
pl_pl: Odnów wszystkie miniaturki
ru_ru: Пересоздать миниатюры

source: Failed resize: %s is an invalid image ID.
pl_pl: Błąd przy zmianie rozmiaru: %s jest nieprawidłowym ID obrazka.
ru_ru: Пересоздание не удалось: %s является неверным ID изображения.

source: Your user account doesn't have permission to resize images
pl_pl: Twoje konto nie posiada wystarczających uprawnień do zmiany rozmiarów obrazków
ru_ru: Ваша учетная запись не имеет прав пересоздания миниатюр

source: The originally uploaded image file cannot be found at %s
pl_pl: Nie można znaleźć pliku oryginalnie przesłanego obrazka pod %s
ru_ru: Оригинальное изображание не удалось найти в %s

source: Unknown failure reason.
pl_pl: Nieznany powód błędu.
ru_ru: Неизвестная причина неудачи.

source: &quot;%1$s&quot; (ID %2$s) was successfully resized in %3$s seconds.
pl_pl: Pomyślnie zmieniono rozmiar &quot;%1$s&quot; (ID %2$s) w przeciągu %3$s sekund.
ru_ru: Миниатюры для &quot;%1$s&quot; (ID %2$s) успешно созданы за %3$s с.

source: &quot;%1$s&quot; (ID %2$s) failed to resize. The error message was: %3$s
pl_pl: Wystąpił błąd podczas zmiany rozmiaru &quot;%1$s&quot; (ID %2$s). Wiadomość błędu: %3$s
ru_ru: Не удалось создать миниатюры для &quot;%1$s&quot; (ID %2$s). Ошибка: %3$s

source: Run
pl_pl: Uruchom
ru_ru: Начать
